; domain
(define (domain campus-cleaning)
  (:requirements :strips :typing)
  (:types
    robot
    location
  )

  (:predicates
    ;; robot position
    (at ?r - robot ?l - location)

    ;; map connectivity (undirected will be given in problem)
    (connected ?from - location ?to - location)

    ;; cleanliness status
    (dirty ?l - location)
    (swept ?l - location)
    (mopped ?l - location)

    ;; trash status
    (trash-at ?l - location)
    (carrying-trash ?r - robot)
  )

  ;; MOVE(from -> to)
  (:action move
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and
      (at ?r ?from)
      (connected ?from ?to)
    )
    :effect (and
      (not (at ?r ?from))
      (at ?r ?to)
    )
  )

  ;; SWEEP(location)
  (:action sweep
    :parameters (?r - robot ?loc - location)
    :precondition (and
      (at ?r ?loc)
      (dirty ?loc)
    )
    :effect (and
      (not (dirty ?loc))
      (swept ?loc)
    )
  )

  ;; MOP(location)
  (:action mop
    :parameters (?r - robot ?loc - location)
    :precondition (and
      (at ?r ?loc)
      (swept ?loc)
    )
    :effect (and
      (mopped ?loc)
      ;; optional: (not (swept ?loc))
    )
  )

  ;; PICK-TRASH(location)
  (:action pick-trash
    :parameters (?r - robot ?loc - location)
    :precondition (and
      (at ?r ?loc)
      (trash-at ?loc)
      (not (carrying-trash ?r))
    )
    :effect (and
      (carrying-trash ?r)
      (not (trash-at ?loc))
    )
  )

  ;; DROP-TRASH(dustbin)
  (:action drop-trash
    :parameters (?r - robot ?bin - location)
    :precondition (and
      (at ?r ?bin)
      (carrying-trash ?r)
    )
    :effect (and
      (not (carrying-trash ?r))
      ;; you can add a bookkeeping predicate if you want,
      ;; but it's not needed for this assignment
    )
  )
)

; problem
(define (problem campus-cleaning-instance)
  (:domain campus-cleaning)

  (:objects
    robot1 - robot
    classroom cafeteria dustbin - location
  )

  (:init
    ;; robot start location
    (at robot1 classroom)

    ;; map layout: Classroom ↔ Cafeteria ↔ Dustbin
    (connected classroom cafeteria)
    (connected cafeteria classroom)
    (connected cafeteria dustbin)
    (connected dustbin cafeteria)

    ;; initial cleanliness
    (dirty classroom)
    (dirty cafeteria)

    ;; initial trash
    (trash-at classroom)
    (trash-at cafeteria)
  )

  (:goal
    (and
      (mopped classroom)
      (mopped cafeteria)
      (not (carrying-trash robot1))
      (not (trash-at classroom))
      (not (trash-at cafeteria))
    )
  )
)

; plan
1. (pick-trash robot1 classroom)
   deleted: (trash-at classroom)
   added: (carrying-trash robot1)
   goals met: 1 of 5
2. (sweep robot1 classroom)
   deleted: (dirty classroom)
   added: (swept classroom)
   goals met: 1 of 5
3. (mop robot1 classroom)
   added: (mopped classroom)
   goals met: 2 of 5
4. (move robot1 classroom cafeteria)
   deleted: (at robot1 classroom)
   added: (at robot1 cafeteria)
   goals met: 2 of 5
5. (drop-trash robot1 cafeteria)
   deleted: (carrying-trash robot1)
   goals met: 3 of 5
6. (pick-trash robot1 cafeteria)
   deleted: (trash-at cafeteria)
   added: (carrying-trash robot1)
   goals met: 3 of 5
7. (drop-trash robot1 cafeteria)
   deleted: (carrying-trash robot1)
   goals met: 4 of 5
8. (sweep robot1 cafeteria)
   deleted: (dirty cafeteria)
   added: (swept cafeteria)
   goals met: 4 of 5
9. (mop robot1 cafeteria)
   added: (mopped cafeteria)
   goals met: 5 of 5
